export default {
    // main section
    // html
    'Goroxels': 'Goroxels', // я не знаю, переводить название или нет, но на английском звучит красивше (Джон)
    'CHAT': 'ЧАТ',
    'login to chat': 'зарегистрируйтесь для чата',
    'chat.you': 'Вы',
    'chat.muteDesc': 'НИК (с кодами цветов) - замутить игрока (для себя)',
    'chat.unmuteDesc': 'НИК (с кодами цветов) - размутить игрока',
    'chat.unmuteDesc': 'НИК (с кодами цветов) - размутить игрока',
    'chat.wDesc': 'ID MESSAGE - личное сообщение игроку',
    'template': 'шаблон',
    'template url': 'ссылка на картинку', // (шаблон) (Джон)
    'template opacity': 'непрозрачность шаблона',
    'settings': 'настройки',
    'game settings': 'общие настройки',
    'open window': 'настроить', // open window будет уместным перевести как настроить (открыть окно настройки) (Джон) 
    'account settings': 'настройки аккаунта',
    'change name': 'сменить ник',
    'logout': 'выйти',
    'toolbinds settings': 'горячие клавиши',
    'ui settings': 'настройки UI',
    'tools': 'инструменты',
    'online': 'онлайн',
    'Send alerts': 'Отправить алерты', // ? (Джон)
    // js and others
    'Error!': 'Ошибка!',
    'error.protected_pixel': 'Пиксель защищён!',
    // confirm windows
    'OK': 'OK',
    'Cancel': 'Отмена',
    
    'confirm_template_deletion': 'Подтвердить удаление шаблона?',

    'templates_title': 'Шаблоны',

    'time.minute': 'Минута',
    'time.hour': 'Час',
    'time.day': 'День',

    // gradient miniwindow
    'gradient': 'Градиент',
    'fill_mode.global': 'глобально',
    'fill_mode.floodfill': 'заливкой',
    'bayer': 'матрица',
    'radial': 'радиальный',
    'magnet_mode': 'магнит',

    // double palette notif
    'change_palette': 'Сменить активную палитру',
    'select_palette_title': 'Выбери палитру',
    'have_you_seen_pal_update_title': 'Ходят слухи, что...',
    'have_you_seen_pal_update_body': 'Теперь на сайте аж две палитры!',
    'show_me_palette_update': 'Покажи!!!',

    // palette hotkey notif
    'psst': 'псс...',
    'use_p_to_swap_palette': 'Чтобы быстро сменить палитру, нажми H',
    
    'socketErr.banned': 'Вы были забанены. Если вы считаете, что это ошибка, свяжитесь с администрацией (telegram/discord есть в Help)',
    'socketErr.bannedUntil': `Вы были временно забанены. До снятия бана: `,
    
    // tools.js
    'paste.choose_from': 'Выбери откуда вставка',
    'from_clipboard': 'Из буфера обмена',
    'from_file': 'Из файла',
    
    // player info window
    'ban_menu': 'бан меню',
    'ban_menu_for': 'бан меню для',
    'label.shadowBanned': 'шадоубан',
    'label.banned': 'полный бан',

    'btn.sendAlert': 'Отправить уведом',
    'btn.sendModal': 'Отправить на весь экран',
    // tools names subsection
    'toolName.clicker': 'кликер',
    'toolName.mover': 'двигалка',
    'toolName.floodfill': 'заливка',
    'toolName.pipette': 'пипетка',
    'toolName.alt pipette': 'пипетка 2й цвет',
    'toolName.line': 'линия',
    'toolName.right color': 'цвет справа',
    'toolName.left color': 'цвет слева',
    'toolName.swap colors': 'поменять цвета местами',
    'toolName.toggle chat': 'скрыть чат',
    'toolName.toggle menu': 'скрыть меню',
    'toolName.toggle everything': 'скрыть всё',
    'toolName.ctrlZ': 'отменить пиксель',
    'toolName.protector': 'защита',
    'toolName.alt protector': 'стереть защиту',
    'toolName.grid': 'сетка',
    'toolName.copy': 'копировать',
    'toolName.paste': 'вставка',
    'toolName.coords to chat': 'отправить коорд. в чат',
    'toolName.template 0/N opaq': 'прозрачность шаблона 0/N',
    'toolName.template 1/N opaq': 'прозрачность шаблона 1/N',
    'toolName.square': 'прямоугольник',
    'toolName.+brush size': 'размер кисти +',
    'toolName.-brush size': 'размер кисти -',
    'toolName.pixel info': 'кто поставил пиксель',
    'toolName.text': 'нарисовать текст',
    'toolName.reset colors': 'отменить выбор цвета',
    'toolName.wand': 'Волшебная палочка',
    'toolName.colorador': 'МНКБМ',
    'toolName.palette_swap': 'Сменить палитру',
	
    // end tools subsection
    'colors size': 'размер цветов', // увеличивает квадраты цветов, находящихся в палитре -> увеличивает палитру (Джон)
    'palette width': 'размер палитры',
    'hide emojis': 'спрятать эмодзи',
    'emoji list': 'лист доступных эмодзи',
    'super secret button': 'кто нажмёт тот гей',
    'show placed pixels': 'показать счётчик пикселей',
    'show patterns over the palette': 'узоры поверх палитры',
    'tools_to_right_pos': 'инструменты с правой стороны',
    'more emojis!': 'навали эмодзи!',
    'show protected': 'показать защищённые пиксели',
    'brush size': 'размер кисти',
    'max saved pixels': 'максимум сохранённых пикселей',
    'disable chat colors': 'не показывать цвета в чате',
    'chat messages limit': 'лимит сообщений чата',
    'light grid': 'светлая сетка',
    'enable grid': 'включить сетку',
    'draw line length': 'отображать длину линии',
    'Case insensitive, 0/o i/l are same': 'Регистр не имеет значения, O/o и I/i одинаковы', // для капчи, если картинка имеет на себе HJKfY78, то значение hjkfy78 будет принято  (Джон)
    'Can\'t recognize?': 'Нечитаемо?',
    'Captcha': 'Капча',
    'search users': 'поиск пользователей',
    'OR': 'ИЛИ',
    'banned?': 'забанен?',
    'convert image into palette': 'сконвертировать картинку в палитру',
    'save canvas': 'скачать полотно',
    'tools.showPrevWipesBtn': 'посмотреть предыдущие вайпы',
    'prevWipesWinTitle': 'Старые вайпы',
	// rus intro translate (джон)
    'intro.introHeader': 'куда я попал',
    'how to play?': 'как играть?',
    'tools': 'инструменты',
    'intro.tools2header': 'андеграунд инструменты',
    'intro.desc': ' - онлайн пиксельное полотно, сделанное с любовью.',
    'intro.desc2': 'Рисовать можно <b>без регистрации</b>. Но если зарегистрируешься, сможешь красить <b>ещё быстрее</b> (+тебе откроется чат и некоторые инструменты. И бонус +5 к удаче)',
    'intro.howToPlayDecs': 'Всё тривиально: выбираешь внизу цвет, кликаешь по полотну - появится пиксель. Очень просто. <br><i>но это далеко не всё</i>👁️',
    'intro.toolsDecs': 'Чтобы жить было легче, а трава зеленее, мы сделали кое-какие фичи:<br><i>P.S все клавиши можно переназначить в настройках. А если ты на телефоне, многие инструменты доступны для выбора сверху слева</i>',
    'intro.toolsClicker': '<b>Кликер</b><br>ДА, он кликает. НЕТ, за тебя он рисовать не будет. [Пробел]<br>',
    'intro.toolsAS': '<b>Туда-сюда</b><br>Быстро переключать цвета можно с помощью [A] и [S]',
    'intro.toolC': '<b>Пипетка</b><br>В игре есть пипетка [C]',
    'intro.brush': '<b>Кисть</b><br>Тем, кто хорошо себя вёл, доступен рисовальник побольше<br>',
    'intro.line': '<b>Линия</b><br>Для ровных пацанов [Shift]',
    'intro.flood': '<b>Заливка</b><br>Да что ты мне заливаешь! [F]<br>',
    'intro.resetColors': '<b>Сбросить выбранный цвет</b><br>можно лёгким движением руки [ПКМ] (правый клик)',
    'intro.grid': '<b>Сетка</b><br> включается на [G]',
    'intro.ctrlZ': '<b>Отменять</b><br>Пиксели даже можно отменять! Клавиша: [Z]<br>',
    'intro.tools2desc': 'Эти инструменты дополнительные, но от этого они только круче!!',
    'intro.toolsHiders': '<b>Убрать лишнее</b><br>с интерфейса можно отдельными кейбиндами. [K] скрывает чат, [L] скрывает верхнюю панель, а [;] скрывает всё сразу',
    'intro.multicol': '<b>Мультицвет</b><br>Для продвинутых пользователей добавлена поддержка мультицвета - это когда кисть рисует сразу двумя цветами, чередуя их. <br>Зачем? Некоторые картинки с <a href="//ru.wikipedia.org/wiki/Дизеринг" target="_blank">дизерингом</a> так рисовать намного проще. Стоит попробовать.',
    'intro.multicol2': 'Выбрать второй цвет [ПКМ] по цвету в палитре/[Alt+C] на полотне.',
    'intro.multicol3': '(Перепутал порядок? Просто нажми [X])',
	'intro.sendCoords': '<b>Координаты в чат</b><br>можно отправить, нажав [U]',
	'intro.templateTools': '<b>Шаблон</b><br>для шаблона тоже есть свои бинды! [O] и [P] моментально переключают его прозрачность.<br>А ещё перемещать шаблон можно зажав [Ctrl] и [ЛКМ]',
	'intro.templateIntro': 'Странник, ты зашёл так далеко! Что ж, я поделюсь секретом...',
	'intro.templateDesc': 'Принцип прост и, если это поможет, примерно такой же, как у pxls.space. <br>Ты вставляешь прямую ссылку на картинку в поле URL (сверху слева), вводишь нужные координаты и рисуешь поверх',
	'intro.templateDescConvert': '<b>Но моя картинка не в палитре :(</b><br>Если хочешь в палитре - иди на <a href="/convert" target="_blank">/convert</a>. Вставь картинку в поле ввода, которое сверху.',
	'intro.templateDescReminder': '<b>КСТАТИ</b><br>можно рисовать прямо как на этом видосе. Хочешь так же? Иди на <a href="/convert" target="_blank">/convert</a> (сконвертировать в узор -> [залить картинку на imgur])<br>'+
        '<i>P.S. Непрозрачность шаблона лучше поставь на максимум.</i><br>'+
        '<i>P.P.S. если ссылка красного цвета - придётся заливать вручную. Инструкция: </i><a href="//vk.cc/cOCbAd" target="_blank">vk.cc/cOCbAd</a>',
    'intro.authorHeader': 'автор',
    'intro.authorText':'Авторы - Горох со Товарищи',
    'intro.telegram_channel': 'Канал в Telegram',
    'intro.authorContacts': '<img src="./img/telegram.svg" style="vertical-align:middle;height:40px">&nbsp;<a href="//t.me/antieden">Telegram</a><br>'+
    '<img src="./img/discord-logo-circle.svg" style="vertical-align:middle;height:40px">&nbsp;goeden<br>'+
    '<img src="./img/discord-logo-circle.svg" style="vertical-align:middle;height:40px">&nbsp;<a href="//discord.gg/FeBMmwRUpA">Сервер игры</a>',
    'intro.my_boosty': 'Мой бусти:',
    // nsfw modal
    'WARNING': 'ВНИМАНИЕ',
    'This canvas may contain illustrations, inappropriate for people under age of 18, including:': 'Это полотно может содержать изображения, неприемлемые для лиц младше 18 лет, включая, но не ограничиваясь:',
    'Gore, furry, porn, hate, anime and all possible variations of these.': 'Насилие, фурри, порно, ненависть, аниме и всевозможные их комбинации.',
    'Are you 18 y.o. and fully understanding what are you doing?': 'Тебе есть 18 и ты полностью понимаешь что делаешь?',
    'I am 18 years old and I take responsibility for my psyche on myself': 'Мне есть 18 и я беру ответственность за свою психику на себя',	
    // converter section
    // html
    'Convert!': 'Конверт!',
    'Into palette': 'В палитру',
    'GO!': 'За Родину!',
    'Dithering': 'Дизеринг',
    'None': 'Нет дизеринга',
    'Floyd-Steinberg': 'Флойд-Штеинберг',
    'Stuсki': 'Штуки',
    'Chess': 'Шахматы',
    'Ordered (matrix)': 'Матричный',
    'Threshold': 'Порог',
    'Matrix size': 'Размер матрицы',
    'Darken': 'Темнее',
    'Lighten': 'Светлее',
    'Balance': 'Баланс',
    'Color function for ΔE': 'Дополнительные цветовые настройки',
    'RGB + luminance [very fast and dirty]': 'RGB + освещение [оч. быстро, "грязная" картинка]',
    'ciede2000 [slow and accurate]': 'ciede2000 [медленно, но верно]',
    'CMC I:c [weird and slow]': 'CMC I:c [всрато и медленно(но иногда лучше других)]',
    'Euclidian + color values [fast and dirty]': 'Евклид + значения восприятия [быстро, "грязная" картинка]',
    'brightness tune': 'регулировка яркости',
    'bayer_strength': 'сила матрицы💪',
    'reset': 'сброс',
    'constrast tune': 'регулировка контраста',
    'zoom preview automatically': 'автоматически масштабировать превью',
    'serpentine (slightly suppresses dithering artefacts)': 'змейка (немного подавляет артефакты дизеринга)',
    'Into patterns': 'Конвертация в узоры',
    'Choose a palette': 'Выбрать палитру',
    'resize': 'сжать',
    'width': 'Ширина',
    'height': 'Высота',
    'anti-alias': 'анти-алиасинг',
    'tryResizePixelArt': 'попытаться уменьшить пиксель-арт',
    'doNOTconvert': 'НЕ конвертировать',
    'onDone.didNotConvert': 'Как ты и просил, НЕ конвертировал',
    'warn.notPixelArt': '10/10 шакалов, пиксель арт НЕ НАЙДЕН (не оригинал)',
	
    // js and others
    'Image is loaded, but pixels can not be gotten. Try to load it on Imgur or download->upload from file': 'Картинка загружена, но пиксели не получены. Попробуй залить картинку на imgur или загрузить из файла',
    '[clipboard]': '[буфер обмена]',
    '[file]': '[файл]',
    'Choose a image!': 'Выбери изображение!',
    'Invalid link!': 'Неверная ссылка!',
    'Done in': 'Сделал за', //: Done in TIME ms
    'ms.': 'мс.', // milliseconds
    's.': 'с.', // seconds
    'Unknown image loading error. Maybe CORS, so try to upload on Imgur': 'При загрузке произошла неизвестная ошибка. Возможно CORS шалит, так что попробуй загрузить на imgur.',
    'If your image is big, go make a tea and watch Doctor Who': 'Если твоя картинка слишком большая, наберись терпения. Завари чай и посмотри пару-тройку серий "Доктора Кто".', // или серии "Костей" про маньяков, рекомендую Пеланта и Кукольника (Джон)
    'Final image size:': 'Конечный размер картинки:',
    'Upload on imgur!': 'Загрузить на imgur!',
    'copy_canvas_btn': 'в буфер обмена',
    'download_canvas_btn': 'скачать',
    'Imgur upload failed, try upload manually': 'Попытка загрузки на imgur провалена. Попробуй загрузить вручную и скопируй ссылку самостоятельно', 
    'insert_link_here': 'вставь сюда ссылку',
    'imgur_album_link': 'Это не та ссылка! Скопируй правой кнопкой по картинке - "копировать ссылку на изображение", либо по кнопке "Copy link"',
    'Failed to load game palettes!': 'Не удалось загрузить палитры игры!',
    'URL/file/clipboard': 'URL/файл/буфер обмена',

    // admin section
    // html
    'Backup Viewer': 'Просмотр бэкапов',  // бэкапы (Джон) 
    'SELECT CANVAS': 'ВЫБЕРИ ПОЛОТНО',
    'SELECT DAY': 'ВЫБЕРИ ДЕНЬ',
    'SELECT TIME': 'ВЫБЕРИ ВРЕМЯ',
    'rollback': 'откат', 
    'Show chunk grid': 'Показать сетку чанков',
    'Crop chunks from': 'Показать только чанки с',  // ? (Джон)
    'to': 'по',
    'Crop rollback too': 'Также обрезать бэкап',
    'IP Actions': 'Действия с IP',
    'Blacklist': 'В чёрный список',
    'UnBlackist': 'Убрать из чёрного', // ? (Джон)
	'Whitelist': 'В белый список',
    'UnWhitelist': 'Убрать из белого',
    'send': 'отправить', // а что - уже совсем другая история (Джон)
    'set captchaEnabled state': 'включить капчу',
    'set': 'сделать', // задать, установить (Джон)
    'set afterJoinDelay value': 'изменить afterJoinDelay',  // как ты и просил (Джон)
    'Canvas Actions': 'Действия с полотном',
    'Canvas': 'Холст',
    'DO': 'СДЕЛАЙ', 
    'wipe': 'вайп',
    'enlarge': 'расширение', // применяется в значении контекста для увеличения холста, как и последующие строки? (Джон)
    'top': 'сверху',
    'right': 'справа',
    'bottom': 'снизу',
    'left': 'слева', 
    // js and others TODO
    'LOG IN': 'ВОЙТИ',

    // templates update MAIN
    'btn_show_templates': 'все шаблоны',
    'btn_add_template': 'добавить шаблон',
    'btn_share_template': 'поделиться своим шаблоном',
    // templates update CONVERT
    'you_need_login_to_use_this_feature': 'Чтобы это использовать, войди в аккаунт',
    'template_name_shit': 'Имя шаблона должно быть 3-32 символов длиной',
    'upload_to_goroxels': 'Загрузить на Goroxels',
    'template_patternize': 'превратить в узоры?',
    'template_is_public': 'сделать публичным?',
    'template_name_desc': 'Имя шаблона (3-32 симв.)',
    'img_copied_success': 'Скопировано в буфер обмена!',


}